Autodesk.Revit.DB.Infrastructure.AlignmentServiceStatus
An enumerated type containing possible request processing statuses for an IAlignmentServer
Since:
2021
Since:
2021

Autodesk.Revit.DB.Infrastructure.AlignmentServiceStatus.ErrorOutsideGeometryRange
Request provided data outside geometry range

Autodesk.Revit.DB.Infrastructure.AlignmentServiceStatus.Failure
Request failed

Autodesk.Revit.DB.Infrastructure.AlignmentServiceStatus.Success
Request executed successfully